import javax.swing.*;
import java.awt.print.Printable;
import java.nio.file.FileSystemNotFoundException;
import java.sql.SQLOutput;

public class Znacheniya {

    //1.3 Максимальное, минимальное и среднее значение
    //Задача:
    //Заполните массив случайным числами и выведите максимальное, минимальное и среднее значение.
    //Для генерации случайного числа используйте метод Math.random(), который возвращает значение в промежутке [0, 1].

  public static void main(String[] args) {
      int[] Array = new int[100];

      double a = Math.random();
      System.out.println(a);
      }


    }
